tap "1password/tap"
tap "databricks/tap"
tap "dbt-labs/dbt"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "microsoft/git"
tap "microsoft/mssql-release"
brew "astro"
brew "azcopy"
brew "azure-cli"
brew "bat"
brew "btop"
brew "cmake"
brew "docker-completion"
brew "docker"
brew "fish"
brew "unixodbc"
brew "freetds"
brew "gh"
brew "git"
brew "glances"
brew "glow"
brew "go"
brew "htop"
brew "krb5"
brew "lighttpd"
brew "mackup"
brew "mas"
brew "minikube"
brew "node"
brew "mongosh"
brew "oh-my-posh"
brew "ollama"
brew "openjdk"
brew "parquet-cli"
brew "pipx"
brew "pkgconf"
brew "poetry"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.10"
brew "python@3.11"
brew "qrencode"
brew "rename"
brew "rust"
brew "scala"
brew "scrapy"
brew "starship"
brew "tealdeer"
brew "telnet"
brew "terraformer"
brew "uv"
brew "uvicorn"
brew "wget"
brew "yarn"
brew "databricks/tap/databricks"
brew "hashicorp/tap/terraform"
cask "1password"
cask "1password-cli"
cask "arc"
cask "bambu-studio"
cask "clone-hero"
cask "copilot-cli"
cask "cursor"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "dotnet-sdk"
cask "elgato-stream-deck"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "obsidian"
cask "open-in-code"
cask "powershell"
cask "pycharm-ce"
cask "raycast"
cask "rectangle"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "warp"
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "BetterSnapTool", id: 417375580
mas "Bitwarden", id: 1352778147
mas "ColorStrokes", id: 459413843
mas "Dark Reader for Safari", id: 1438243180
mas "Disconnect Premium", id: 1333277187
mas "Final Cut Pro", id: 424389933
mas "Focus 2", id: 740472063
mas "GarageBand", id: 682658836
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Intensify", id: 716854513
mas "Ivory", id: 6444602274
mas "Keynote", id: 409183694
mas "KyPass", id: 555293879
mas "Logic Pro", id: 634148309
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Mobility for Jira", id: 898500641
mas "NewsGuard", id: 1438657064
mas "Noiseless", id: 969978718
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PayPal Honey", id: 1472777122
mas "Privacy Pro", id: 1051960818
mas "Snapheal", id: 480623975
mas "Snapselect", id: 935700987
mas "Spark", id: 1176895641
mas "Super Agent", id: 1568262835
mas "Swift Playground", id: 1496833156
mas "The Camelizer", id: 1532579087
mas "Tonality", id: 892581529
mas "VisualXML", id: 617516344
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
vscode "amykyta3.systemrdl"
vscode "beardedbear.beardedicons"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "databricks.databricks"
vscode "davidbwaters.macos-modern-theme"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "fabiospampinato.vscode-diff"
vscode "file-icons.file-icons"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "grapecity.gc-excelviewer"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.live-server"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "parallelsdesktop.parallels-desktop"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "searking.preview-vscode"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tonybaloney.vscode-pets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
